--dict_layout table
 
dict_layout = {
    ["1"] = {id = "1", desc = "大厅", contain_unit = {{1,{2,3}},{4,{501,11}}}},
    ["2"] = {id = "2", desc = "老虎机二级菜单", contain_unit = {{108,102},{107,104},{109,110},{111,112},{17,17}}},
    ["3"] = {id = "3", desc = "BlacekJack二级菜单", contain_unit = {{201},{202},{203},{204}}},
    ["4"] = {id = "4", desc = "VideoPoker二级菜单", contain_unit = {{301},{302},{303},{304}}},
    ["5"] = {id = "5", desc = "德州扑克二级菜单", contain_unit = {{402},{405},{406},{407}}},
    ["6"] = {id = "6", desc = "挑战游戏二级菜单", contain_unit = {{1001,1002},{16,16},{16,16},{16,16}}},
    ["7"] = {id = "7", desc = "捕鱼达人", contain_unit = {{501},{16},{16},{16}}}
}

    

